<a href="https://colab.research.google.com/github/HunterBlosser/ds1002-zpk9ym/blob/main/homework/week-13.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Homework - Week 13

Complete the following blocks as specified in the directions. Run each cell to return the desired output. Save your notebook back to your GitHub repository and submit the GitHub URL to your notebook for review.

## 1. Change Runtime to R (1 pt)

Change the runtime of this notebook to R. You can verify that you are running R by displaying the current version you are running. Run the cell below and show the output.

In [1]:
version

               _
platform       x86_64-pc-linux-gnu
arch           x86_64
os             linux-gnu
system         x86_64, linux-gnu
status
major          4
minor          3.2
year           2023
month          10
day            31
svn rev        85441
language       R
version.string R version 4.3.2 (2023-10-31)
nickname       Eye Holes

## 2. Create Vectors (2 pts)

Create two vectors in the cells below, according to the prompts given.

In [4]:
# create a vector with 7 integer values. Assign it to a variable named "my_integers"
my_integers<-c(1, 2, 3, 4, 5, 6, 7)

In [9]:
var1 = 8
var2 = 4
var3 = 12
var4 = 25

# Using the variables given above, assign three new variables the following calculated values:
#
# 1. Your first variable should be assigned the calculated value of var2 divided by var1.
# 2. Your second variable should be assigned the calculated value of var2 cubed times var3.
# 3. Your third variable should be assigned the calculated value of var4 integer divided by var3.
#
# Next, create an array populated by your three variables. Assign the array to a new variable named "my_calculated_values"

var5<-var2/var1
var6<-(var2^3)*var3
var7<-var4/var3
my_calculated_values <-data.frame(var5,var6,var7)
my_calculated_values

  var5 var6 var7
1 0.5  768  2.083333

## 3. Vector Indexes (3 pts)

In the cell below, create a vector that starts with the integer 4, that increments by counts of 3 all the way to 28.

Assign the vector to a variable name.

In [11]:
#
vector <- seq(from=4, to=28, by=3)
vector

[1]  4  7 10 13 16 19 22 25 28

Next, show how to display this vector with the 3 index removed.

In [12]:
#
vector[-3]

[1]  4  7 13 16 19 22 25 28

Finally, show how to delete the 4th, 5th, and 7th indexes from the vector and update the vector so they are forever removed from the vector.

Hint: there is a fairly simple way to do this in one line, such that you don't have to run a separate command for each removal.

In [13]:
#
vector[-4:-7]

[1]  4  7 10 25 28

## 4. Create a Data Frame (3 pts)

In the cell below create a data frame with 10 observations (rows) and 5 variables (columns) each. This data frame will describe some of your favorite musical performers. You can use real or fictitious data to populate your data frame.

Variables:
  - `artist` - Artist or band name
  - `category` - Rock, Pop, Country, Hip-hop, Jazz, Classical, Soul, Other. (Try to distribute your selections here)
  - `size` - (number of members, 1-?)
  - `start` - Debut year of artist.
  - `grammy` - Grammmy winner? `TRUE` | `FALSE`

First create vectors for each variable populated with your own performer data. Then create a data frame from these vectors (be sure to assign column names too) and assign it to a named variable such as `df`.

In [19]:
artist<-c('guns and roses', 'luke combs', 'metallica', 'drake', 'nirvana', 'peral jam', 'luke bryan', 'steve miller band','travis scott','eminem')
category<-c('rock','country','rock','rap','rock','rock','country','rock','rap','rap')
size<-c(7,1,8,1,11,9,1,12,1,1)
start<-c(1985, 2017, 1981, 2009, 1987, 1990, 2014, 1966, 2015, 1998)
grammy<-c(TRUE, FALSE, TRUE, FALSE, TRUE, FALSE, TRUE, FALSE, TRUE, FALSE)
df<-data.frame(artist = artist, genre = category, members = size, start = start, grammy = grammy)
df

   artist            genre   members start grammy
1  guns and roses    rock     7      1985   TRUE
2  luke combs        country  1      2017  FALSE
3  metallica         rock     8      1981   TRUE
4  drake             rap      1      2009  FALSE
5  nirvana           rock    11      1987   TRUE
6  peral jam         rock     9      1990  FALSE
7  luke bryan        country  1      2014   TRUE
8  steve miller band rock    12      1966  FALSE
9  travis scott      rap      1      2015   TRUE
10 eminem            rap      1      1998  FALSE

## 5. Filter/Query a Data Frame (2 pts)

Use the data frame you created above and show how to perform the following queries.

In [21]:
# Display the first 3 records and only the `artist`, `category` and `grammy` columns for each.
df[1:3, c(1,2,5)]

  artist         genre   grammy
1 guns and roses rock     TRUE
2 luke combs     country FALSE
3 metallica      rock     TRUE

In [25]:
# Display the records for just one musical category, such as only Rock bands or only Hip-hop bands.
df[df$genre == 'rock',]

  artist            genre members start grammy
1 guns and roses    rock   7      1985   TRUE
3 metallica         rock   8      1981   TRUE
5 nirvana           rock  11      1987   TRUE
6 peral jam         rock   9      1990  FALSE
8 steve miller band rock  12      1966  FALSE

## Query a Data Frame using `tidyverse` (4 pts)

1. Show how to load the library.
2. Show how to glimpse basic features of the `starwars` data table.
3. Create a query using tidyverse that retrieves the following data:
    - Selects only these columns: `name`, `height`, `sex`, `species`.
    - Filters for all species that are NOT Human.
    - Arranges the resulting data in order by name.

Show your output in a data frame.

In [ ]:
#
install.packages("tidyverse")
library(tidyverse)

In [ ]:
str(starwars)

In [29]:
starwars %>%
  select(name, height, sex, species) %>%
  filter(species != 'Human') %>%
  arrange(name)

   name                  height sex            species
1  Ackbar                180    male           Mon Calamari
2  Adi Gallia            184    female         Tholothian
3  Ayla Secura           178    female         Twi'lek
4  BB8                    NA    none           Droid
5  Barriss Offee         166    female         Mirialan
6  Ben Quadinaros        163    male           Toong
7  Bib Fortuna           180    male           Twi'lek
8  Bossk                 190    male           Trandoshan
9  C-3PO                 167    none           Droid
10 Chewbacca             228    male           Wookiee
11 Darth Maul            175    male           Zabrak
12 Dexter Jettster       198    male           Besalisk
13 Dud Bolt               94    male           Vulptereen
14 Eeth Koth             171    male           Zabrak
15 Gasgano               122    male           Xexto
16 Greedo                173    male           Rodian
17 Grievous              216    male           Kaleesh
18 IG-88                 200    none           Droid
19 Jabba Desilijic Tiure 175    hermaphroditic Hutt
20 Jar Jar Binks         196    male           Gungan
21 Ki-Adi-Mundi          198    male           Cerean
22 Kit Fisto             196    male           Nautolan
23 Lama Su               229    male           Kaminoan
24 Luminara Unduli       170    female         Mirialan
25 Mas Amedda            196    male           Chagrian
26 Nien Nunb             160    male           Sullustan
27 Nute Gunray           191    male           Neimodian
28 Plo Koon              188    male           Kel Dor
29 Poggle the Lesser     183    male           Geonosian
30 R2-D2                  96    none           Droid
31 R4-P17                 96    none           Droid
32 R5-D4                  97    none           Droid
33 Ratts Tyerell          79    male           Aleena
34 Roos Tarpals          224    male           Gungan
35 Rugor Nass            206    male           Gungan
36 Saesee Tiin           188    male           Iktotchi
37 San Hill              191    male           Muun
38 Sebulba               112    male           Dug
39 Shaak Ti              178    female         Togruta
40 Tarfful               234    male           Wookiee
41 Taun We               213    female         Kaminoan
42 Tion Medon            206    male           Pau'an
43 Wat Tambor            193    male           Skakoan
44 Watto                 137    male           Toydarian
45 Wicket Systri Warrick  88    male           Ewok
46 Yarael Poof           264    male           Quermian
47 Yoda                   66    male           Yoda's species
48 Zam Wesell            168    female         Clawdite